In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
sns.set(style='darkgrid')
import warnings
warnings.filterwarnings('ignore')

In [23]:
incidentes = pd.read_csv("./data/Incidente.csv")
localizacion = pd.read_csv("./data/Localizacion.csv")
tabla_Calle = pd.read_csv("./data/tipo_Calle.csv")
tabla_acusados = pd.read_csv("./data/Type_Acusados.csv")
tabla_victimas = pd.read_csv("./data/Type_Victimas.csv")
victimas = pd.read_csv("./data/Victimas.csv")

In [24]:
incidentes.head(1)

          ID  N_VICTIMAS       FECHA      HORA PARTICIPANTES  VICTIMA  ACUSADO
0  2016-0001           1  2016-01-01  04:00:00     MOTO-AUTO        0        0

In [25]:
incidentes.dtypes

ID               object
N_VICTIMAS        int64
FECHA            object
HORA             object
PARTICIPANTES    object
VICTIMA           int64
ACUSADO           int64
dtype: object

In [27]:
localizacion.head(1)

,ID,FECHA,AAAA,MM,DD,HORA,HH,LUGAR_DEL_HECHO,TIPO_DE_CALLE,Calle,Altura,Cruce,Dirección Normalizada,COMUNA,XY (CABA),pos x,pos y
0,2016-0001,2016-01-01,2016,1,1,04:00:00,4,AV PIEDRA BUENA Y AV FERNANDEZ DE LA CRUZ,0,PIEDRA BUENA AV.,NaN,"FERNANDEZ DE LA CRUZ, F., GRAL. AV.","PIEDRA BUENA AV. y FERNANDEZ DE LA CRUZ, F., G...",8,Point (98896.78238426 93532.43437792),-58.47533969,-34.68757022

In [28]:
localizacion.dtypes

ID                        object
FECHA                     object
AAAA                       int64
MM                         int64
DD                         int64
HORA                      object
HH                        object
LUGAR_DEL_HECHO           object
TIPO_DE_CALLE              int64
Calle                     object
Altura                   float64
Cruce                     object
Dirección Normalizada     object
COMUNA                     int64
XY (CABA)                 object
pos x                     object
pos y                     object
dtype: object

In [29]:
tabla_Calle.head(1)

   ID_calle Calificacion                                        Descripcion
0         0      AVENIDA  Arteria cuya calzada tiene un ancho total de p...

In [30]:
tabla_Calle.dtypes

ID_calle         int64
Calificacion    object
Descripcion     object
dtype: object

In [31]:
tabla_victimas.head(1)

   Type_Victim Calificacion                                        Descripcion
0            0         MOTO  Vehiculo a motor no carrozado que incluye moto...

In [32]:
tabla_victimas.dtypes

Type_Victim      int64
Calificacion    object
Descripcion     object
dtype: object

In [33]:
tabla_acusados.head(1)

   id_Acusado Calificacion                                        Descripción
0           0         AUTO  Vehiculo a motor destinado al transporte de pe...

In [34]:
tabla_acusados.dtypes

id_Acusado       int64
Calificacion    object
Descripción     object
dtype: object

In [35]:
victimas.head(1)

,ID_hecho,FECHA,AAAA,MM,DD,ROL,VICTIMA,SEXO,EDAD,FECHA_FALLECIMIENTO
0,2016-0001,2016-01-01,2016,1,1,CONDUCTOR,0,MASCULINO,19,2016-01-01 00:00:00

In [36]:
victimas.dtypes

ID_hecho               object
FECHA                  object
AAAA                    int64
MM                      int64
DD                      int64
ROL                    object
VICTIMA                 int64
SEXO                   object
EDAD                   object
FECHA_FALLECIMIENTO    object
dtype: object